{
    "admin": "awest",
    "channels": [
        "#main"
    ],
    "dadName": "dad",
    "debug": false,
    "grounded": [
        "theCount",
        "Doge",
        "Magic_Conch",
        "Seahorse",
        "l",
        "jlong",
        "noahsiano"
    ],
    "ip": "coop.test.adtran.com",
    "messageRate": {
        "messages": 2,
        "milliseconds": 60000
    },
    "momName": "mom",
    "speak": {
        "dadName": {
            "regex": [
                "(^|\\s+)dad(dy|a)?($|\\W+)",
                "(^|\\s+)father($|\\W+|,)",
                "(^|\\s+)(pop){1,2}(s)?($|\\W+)",
                "(^|\\s+)(pa){1,2}($|\\W+)"
            ],
            "responses": {
                "ask": [
                    [
                        "Ask your mother."
                    ]
                ],
                "joke": [
                    [
                        "\"Ill call you later.\"\nDon't call me later, call me Dad",
                        0
                    ],
                    [
                        "Can February March?\nNo, but April May",
                        1
                    ],
                    [
                        "Dad, can you put my shoes on?\nI don't think they'll fit me",
                        0
                    ],
                    [
                        "Dad, can you put the cat out?\nI didn't know it was on fire",
                        0
                    ],
                    [
                        "Dad, did you get a haircut?\nNo I got them all cut",
                        0
                    ],
                    [
                        "Did you hear about the cheese factory that exploded in France?\nThere was nothing left but de Brie",
                        0
                    ],
                    [
                        "Did you hear about the guy who invented the knock knock joke?\nHe won the 'no-bell' prize",
                        0
                    ],
                    [
                        "Did you hear about the restaurant on the moon?\nGreat food, no atmosphere",
                        0
                    ],
                    [
                        "Don't trust atoms\nThey make up everything",
                        0
                    ],
                    [
                        "Have you heard of the band 1023MB?\nThey haven't got a gig yet",
                        0
                    ],
                    [
                        "How many apples grow on a tree?\nAll of them",
                        0
                    ],
                    [
                        "I am terrified of elevators,\nI'm going to start taking steps to avoid them",
                        1
                    ],
                    [
                        "I bought shoes from a drug dealer once\nI don't know what he laced them with, but I was tripping all day",
                        0
                    ],
                    [
                        "I hate jokes about german sausages\nThey're the wurst",
                        1
                    ],
                    [
                        "I just watched a program about beavers\nIt was the best dam program I've ever seen",
                        0
                    ],
                    [
                        "I knew I shouldn't have had the seafood\nI'm feeling a little eel",
                        0
                    ],
                    [
                        "I used to hate facial hair,\nbut then it grew on me",
                        0
                    ],
                    [
                        "I wouldn't buy anything with velcro\nIt's a total rip-off",
                        0
                    ],
                    [
                        "I'd like to give a big shout out to all the sidewalks\nfor keeping me off the streets",
                        0
                    ],
                    [
                        "I'm not addicted to brake fluid\nI can stop whenever I want",
                        0
                    ],
                    [
                        "I'm reading a book on the history of glue\nI just can't seem to put it down",
                        0
                    ],
                    [
                        "I've just been diagnosed as colorblind\nI know, it certainly has come out of the purple",
                        0
                    ],
                    [
                        "If prisoners could take their own mug shots,\nthey'd be called cellfies",
                        0
                    ],
                    [
                        "Is this pool safe for diving?\nIt deep ends",
                        0
                    ],
                    [
                        "Last night I dreamt I was a muffler\nI woke up exhausted",
                        0
                    ],
                    [
                        "My wife is on a tropical food diet, the house is full of the stuff\nIt's enough to make a mango crazy",
                        0
                    ],
                    [
                        "Our wedding was so beautiful,\neven the cake was in tiers",
                        0
                    ],
                    [
                        "This graveyard looks overcrowded,\npeople must be dying to get in there",
                        0
                    ],
                    [
                        "Two satellites decided to get married\nThe wedding wasn't much, but the reception was incredible",
                        0
                    ],
                    [
                        "Wanna hear a joke about paper?\nNevermind, it's tearable",
                        0
                    ],
                    [
                        "What did the buffalo say to his son when he left for college?\nBison",
                        0
                    ],
                    [
                        "What did the grape do when he got stepped on?\nHe let out a little wine",
                        0
                    ],
                    [
                        "What did the officer molecule say to the suspect molecule?\nI've got my ion you",
                        1
                    ],
                    [
                        "What do prisoners use to call each other?\nCell phones",
                        0
                    ],
                    [
                        "What do you call a deer with no eyes?\nNo idear",
                        0
                    ],
                    [
                        "What do you call a fake noodle?\nAn Impasta",
                        0
                    ],
                    [
                        "What do you call a pony with a sore throat?\nA little horse",
                        0
                    ],
                    [
                        "What do you call a sketchy Italian neighbour hood?\nThe Spaghetto",
                        0
                    ],
                    [
                        "What do you call an Argentinian with a rubber toe?\nRoberto",
                        0
                    ],
                    [
                        "What do you call cheese by itself?\nProvolone",
                        0
                    ],
                    [
                        "What do you call cheese that isn't yours?\nNacho Cheese",
                        0
                    ],
                    [
                        "What do you call somebody with no body and no nose?\nNobody knows",
                        0
                    ],
                    [
                        "What do you get when you cross a snowman with a vampire\nFrostbite",
                        0
                    ],
                    [
                        "What does an annoying pepper do?\nIt get's jalapeno face",
                        0
                    ],
                    [
                        "What lies at the bottom of the ocean and twitches?\nA nervous wreck",
                        0
                    ],
                    [
                        "Where do you learn to make ice cream?\nSunday school",
                        0
                    ],
                    [
                        "Where does Fonzie like to go for lunch?\nChick-Fil-Eyyyyyyyy",
                        0
                    ],
                    [
                        "Why can't you have a nose 12 inches long?\nBecause then it would be a foot",
                        0
                    ],
                    [
                        "Why can't you hear a pterodactyl go to the bathroom?\nBecause the pee is silent",
                        0
                    ],
                    [
                        "Why couldn't the bicycle stand up by itself?\nIt was two tired",
                        0
                    ],
                    [
                        "Why did the can-crusher quit his job?\nBecause it was soda-pressing",
                        0
                    ],
                    [
                        "Why did the coffee file a police report?\nIt got mugged",
                        0
                    ],
                    [
                        "Why did the scarecrow win an award?\nBecause he was outstanding in his field",
                        0
                    ],
                    [
                        "Why do bees hum?\nBecause they don't know the words",
                        0
                    ],
                    [
                        "Why do crabs never give to charity?\nBecause they're shellfish.",
                        0
                    ],
                    [
                        "Why don't skeletons ever go trick or treating?\nBecause they have no body to go with",
                        0
                    ],
                    [
                        "The Norwegian navy has started putting bar codes on their ships...\nSo they can scan da navy in...",
                        0
                    ],
                    [
                        "Singing in the shower is all fun and games until you get shampoo in your mouth...\nThen it becomes a soap opera...",
                        0
                    ],
                    [
                        "I have no children but I still tell dad jokes\nhe loves them",
                        0
                    ],
                    [
                        "What's brown and sticky?\nA stick.",
                        0
                    ],
                    [
                        "What do you call crystal clear urine?\n1080pee",
                        0
                    ],
                    [
                        "Today I found out that someone has been adding fertilizer to my front lawn.\nThe plot thickens...",
                        0
                    ],
                    [
                        "What do you call a non-skiing Inuit?\nAn emo",
                        0
                    ],
                    [
                        "I got a haircut last week...\nAt first I didn't like it, but it's growing on me",
                        0
                    ],
                    [
                        "Wanna hear a little pickle joke?\n.....it's not that big of dill.",
                        0
                    ],
                    [
                        "Say, Ernie? Would you like some ice cream?\nYes, sherbert.",
                        0
                    ],
                    [
                        "Why did the old lady fall in the well?\nShe couldn't see that well",
                        0
                    ],
                    [
                        "What's the difference between a coyote and a flea?\nOne howls on the prairie and the other prowls on the hairy.",
                        0
                    ],
                    [
                        "A judge sentenced me to take a guy out to dinner.\nIt was a court mandate",
                        0
                    ],
                    [
                        "How do you shoot a rocket?\nFire works",
                        0
                    ],
                    [
                        "What time did the man go to the dentist?\nTooth Hurty",
                        1
                    ],
                    [
                        "Thought taking my shell of my racing snail would make it faster.\nTurns out that just made it more sluggish.",
                        0
                    ],
                    [
                        "If anybody knows any salad jokes.\nLettuce know......",
                        0
                    ],
                    [
                        "How do you feel?\nWith your hands",
                        0
                    ],
                    [
                        "Did you hear about the guy thrown in jail for not taking a nap?\nHe was refusing a rest",
                        0
                    ],
                    [
                        "I love ruining the plot of Dorian Gray for people\nNever gets old.",
                        0
                    ],
                    [
                        "Where do belly buttons go to college\nNaval Academy",
                        0
                    ],
                    [
                        "Took my kids out to a Plane Factory for a tour.\nThey said it was Boeing.",
                        0
                    ],
                    [
                        "Buddhist monk walks into a pizza parlor...\nSays, \"Make me one with everything.\"",
                        0
                    ],
                    [
                        "Mums trying to stop me eating as she reckons its getting out of hand.\nLuckily, I've got a few Twix up my sleeve.",
                        0
                    ],
                    [
                        "Why did the first shoemaker go to hell?\nBecause he sold his sole to the devil.",
                        0
                    ],
                    [
                        "What does an oyster wear into battle?\nClamouflage",
                        0
                    ],
                    [
                        "My daughter kept complaining that it was too cold.\nI told her to go stand in the corner, it's 90 degrees there.",
                        0
                    ],
                    [
                        "A dentist is working on a judge and promises one thing....\n....to take the tooth, the whole tooth, and nothing but the tooth.",
                        1
                    ],
                    [
                        "What did the green grape say to the purple grape?\nBREATHE!",
                        0
                    ],
                    [
                        "My wife visited a holy city\nShe completely fell through it all.",
                        0
                    ],
                    [
                        "Do I enjoy making courthouse puns?\nGuilty.",
                        0
                    ],
                    [
                        "How do you know an egg is bad?\nWhen it's past the eggsperation date.",
                        0
                    ],
                    [
                        "What do you call a genie made of asbestos?\nA carcinojinn.",
                        0
                    ],
                    [
                        "My friend threatened to turn me into the police for bludgeoning his wife to death with a Super Nintendo\nSo I had to console him as well.",
                        0
                    ],
                    [
                        "Why do so many people invest in Ireland?\nBecause the capital is always Dublin!",
                        0
                    ],
                    [
                        "What do you call someone with a very colorful personality?\nA hue-man",
                        0
                    ],
                    [
                        "What do you call a man with no arms or legs lying in front of your door?\nMatt",
                        0
                    ],
                    [
                        "RIP boiled water.\nYou will be mist.",
                        0
                    ],
                    [
                        "My gf told me she gets weirded out when I'm too literal.\nSo I gave her a piece of my mind.",
                        0
                    ],
                    [
                        "What is the difference between a fly and a bird?\nA bird can fly but a fly can't bird",
                        0
                    ],
                    [
                        "I just bought a vintage Rolls Royce, but the budget didn't cover a driver.\nSo I spent all that money, and I've got nothing to chauffeur it.",
                        0
                    ],
                    [
                        "Why is Cyclops in charge of the X-Men?\nBecause Prof. X made him a supervisor.",
                        0
                    ],
                    [
                        "What would Forrest Gumps email password be?\n1Forrest1",
                        0
                    ],
                    [
                        "I don't usually tell tell dad jokes\n.............",
                        0
                    ],
                    [
                        "What type of dog can do magic tricks?\nA labracadabrador",
                        0
                    ],
                    [
                        "I used to collect cacti...\nbut agave that up years ago.",
                        0
                    ],
                    [
                        "I heard a beaver lost its home today.\nDam shame, too.",
                        0
                    ],
                    [
                        "Two guys are sitting in a boat.\nThey have a bunch of cigarettes, but neither of them brought any matches to light them. So one of the guys throws one cigarette off the boat, and the boat becomes a cigarette lighter.",
                        0
                    ],
                    [
                        "How come everyone in history has always settled for Shampoo?\nStop the madness! Demand Realpoo!",
                        0
                    ],
                    [
                        "Know why the native Americans were here first?\n...because they had reservations.",
                        0
                    ],
                    [
                        "I saw an article about people snorting chocolate powder for a rush.\nThey wanted a Quik high.",
                        0
                    ],
                    [
                        "What nationality are you when you're in the bathroom?\nEuropean.",
                        0
                    ],
                    [
                        "What happened when the crustacean was late to work?\nShe LOBSTER job!",
                        0
                    ],
                    [
                        "Why is fatty acid the coolest carbon chain?\nBecause it's fat with a pH",
                        0
                    ],
                    [
                        "Today I threw my dog in the ocean.\nHe was a good buoy.",
                        0
                    ],
                    [
                        "A ham sandwich walks into a bar and orders a beer.\nBartender says \"Sorry, we don't serve food here\"",
                        0
                    ],
                    [
                        "My boy asked me to hand him his sunglasses.\nI told him I'd do it as soon as he handed me my dadglasses",
                        0
                    ],
                    [
                        "Why did the melons have a formal wedding?\nBecause they cantaloupe.",
                        0
                    ],
                    [
                        "Was Noah an...\n...ark-itect?",
                        0
                    ],
                    [
                        "Why did the 2 Egyptian farters get along so well?\nBecause they had a Tutankhamen.",
                        0
                    ],
                    [
                        "I said to my wife, \"They say that childbirth is the most painful thing someone can experience...\"\nNow, maybe I was too young to remember, but I didn't think it hurt that much.",
                        0
                    ],
                    [
                        "What do you call a waffle on a California beach?\nA Sandy Eggo...",
                        0
                    ],
                    [
                        "How do you fight off the flu?\nWith kung-flu",
                        0
                    ],
                    [
                        "I can understand 4 feet, 5 feet, 7 feet and 8 feet\nBut I can't fathom",
                        0
                    ],
                    [
                        "How do you make holy water?\nYou boil the hell out of it",
                        0
                    ],
                    [
                        "Why did my TV start looking so good this year?\nIt was his new years resolution",
                        0
                    ],
                    [
                        "I once started a hotdog business...\nIt was the wurst thing I ever did.",
                        1
                    ],
                    [
                        "I tried to catch clouds yesterday.\nMist. Guess i'll have to fog-et about it.",
                        0
                    ],
                    [
                        "Did you hear about the man who got hit in the head by a can of soda?\nDon't worry, he's fine. It was a soft drink.",
                        1
                    ],
                    [
                        "Did you hear about the mathematical breakthrough in algebra?\nIt was on the hypotenews",
                        0
                    ],
                    [
                        "I bought a gallon of White Out.\nBig Mistake..",
                        0
                    ],
                    [
                        "My Dad and I sighed at the same time today.\nHe said \"Wow, that was sighmultaneous.\"",
                        0
                    ],
                    [
                        "What did the waning full moon say to his girlfriend?\nAt least gibbous a kiss goodbye.",
                        0
                    ],
                    [
                        "How can guinea pigs cope so well in the cold?\nIt's Chile near where they're from.",
                        0
                    ],
                    [
                        "If you need to start a fire by rubbing sticks together, make sure they are the same.\nThen you'll have a match.",
                        1
                    ],
                    [
                        "Why do med students use books to study anatomy?\nBecause books have spines.",
                        0
                    ],
                    [
                        "I just invented a machine that trims window coverings.\nPrepare to have your blinds mowed.",
                        0
                    ],
                    [
                        "To the mathematicians who thought of the idea of zero...\nThanks for nothing.",
                        0
                    ],
                    [
                        "What did the sheep say to the shepherd?\nStop it!  You're herding me!!",
                        0
                    ],
                    [
                        "What do you call a van on fire?\nA vanpyre.",
                        1
                    ],
                    [
                        "I'm not huge into puns.\nSometimes eye roll with it.",
                        0
                    ],
                    [
                        "How do subatomic pirates mutiny?\nThey make the captain walk the planck.",
                        1
                    ],
                    [
                        "What happens on a clear day in Los Angeles?\nUCLA.",
                        0
                    ],
                    [
                        "Why did the ragdoll change her mind?\nIt was suede!",
                        0
                    ],
                    [
                        "My girlfriend is so good at drawing straight lines that she would thrive in an anarchist society...\n...because she doesn't need a ruler.",
                        0
                    ],
                    [
                        "What's the opposite of cinnamon toast crunch?\nAntonym toast crunch",
                        1
                    ],
                    [
                        "I was arrested for telling my dad the best joke ever...\nPolice said manslaughter was illegal",
                        0
                    ],
                    [
                        "Dentist: Open up please\nMe: sometime I get sad and I don't know why",
                        0
                    ],
                    [
                        "I had to take down some scaffold that was in the way at work.\nIt held me up long enough.",
                        0
                    ],
                    [
                        "I broke my finger today..\n..but on the other hand I'm completely fine.",
                        0
                    ],
                    [
                        "Have you heard the rumor going around about butter?\nNevermind, I really shouldn't spread it.",
                        0
                    ],
                    [
                        "What is your favorite month?\nNo it's not. July!",
                        0
                    ],
                    [
                        "The people at my hair salon make me wanna..\nCurl up and dye.",
                        0
                    ],
                    [
                        "My dad said if I use a hashtag one more time, he'd pound the sh*t out of me. I said #YOLO and woke up to this text the next morning...\n####################",
                        1
                    ],
                    [
                        "I spent a whole day making a belt with my old watches\nIt was a waist of time",
                        0
                    ],
                    [
                        "I've said it before and I'll say it again\nI've said it before",
                        1
                    ],
                    [
                        "What did the cookie say to the browser while running away?\n\"Cache me if you can!\"",
                        1
                    ],
                    [
                        "Do you want me to call you an uber?\nYou're an uber.",
                        1
                    ],
                    [
                        "What do you call Mr. Bean on a boat?\nRowing Atkinson",
                        0
                    ],
                    [
                        "My friend keeps telling me to stop making Rogue One puns.\nShe's told me that like 10 Erso times.",
                        0
                    ],
                    [
                        "I tell Dad Jokes but I'm not a dad..\nI'm a faux pa.",
                        0
                    ],
                    [
                        "I went to the seafood disco last night...\nI pulled a muscle!",
                        0
                    ],
                    [
                        "I was surprised to hear that Adele uses a MacBook\nI always thought she'd use a Dell.",
                        0
                    ],
                    [
                        "6 was afraid of 7 because 7, 8, 9, but why did 7 eat 9?\nBecause you're supposed to eat 3 squared meals a day.",
                        0
                    ],
                    [
                        "I don't know why Euthanasia is so controversial.\nI personally don't mind Asian kids.",
                        0
                    ],
                    [
                        "And the Lord said unto John; \"Come forth and receive eternal life!\nBut John came fifth and won a toaster.",
                        0
                    ],
                    [
                        "Have you heard about the guy who had his whole left side chopped off?\nYeah he's all right now",
                        0
                    ],
                    [
                        "Why do cows have hooves instead of feet?\nBecause they lactose.",
                        0
                    ],
                    [
                        "Do you know what the first thing a couple says when they're married?\nI do",
                        0
                    ],
                    [
                        "I'd love to get into gardening...\n...now that I have more thyme on my hands.",
                        0
                    ],
                    [
                        "In the annual scientistific track and field meet, the geologists always lose\nProving once again that gneiss guys finish last.",
                        0
                    ],
                    [
                        "Your argument is like a naked banana\nIt simply lacks a peel",
                        0
                    ],
                    [
                        "Got the perfect title for the 10th fast and furious movie.\nFast 10: your seatbelts",
                        0
                    ],
                    [
                        "How do porn actors say goodbye to each other?\nSo long.",
                        0
                    ],
                    [
                        "What country is next to USA\nUSB",
                        0
                    ],
                    [
                        "It's hard to lose a radish.\nBecause a lot of the time they'll turn up",
                        0
                    ],
                    [
                        "What type of bagel can fly?\nA plain bagel.",
                        0
                    ],
                    [
                        "An apple a day\nPuts the doctors out of a job",
                        0
                    ],
                    [
                        "Mary had a little lamb\nand a side of veggies for dinner.",
                        1
                    ],
                    [
                        "Why do sharks swim in salt water?\nBecause pepper water makes them sneeze.",
                        0
                    ],
                    [
                        "Did you hear the good news about O.J.?\nIt is part of a complete breakfast",
                        0
                    ],
                    [
                        "Why does everybody hate averages?\nBecause they're mean",
                        0
                    ],
                    [
                        "I like the theory of the death penalty\nBut I have a problem with the execution.",
                        0
                    ],
                    [
                        "Did you hear about the kidnapping in Denver?\nHe woke up.",
                        0
                    ],
                    [
                        "Why was the energizer bunny put in jail?\nHe was charged with battery",
                        0
                    ],
                    [
                        "I was recently in a boating accident...\nIt was quite an oar-deal.",
                        0
                    ],
                    [
                        "Why isn't a koala bear a real bear\nBecause they aren't koala-fied",
                        0
                    ],
                    [
                        "What do you call a minister that does shoe repair?\nPreach Cobbler",
                        0
                    ],
                    [
                        "My wife asked \"What's your favorite vegetable.\"\nBeets me!",
                        0
                    ],
                    [
                        "What do you call a tree who's limbs fell off in a storm?\nAn amputree",
                        0
                    ],
                    [
                        "One time I ate a whole bunch of cheese in one sitting....\nWhere there's a wheel there's a way.",
                        0
                    ],
                    [
                        "I don't think I can trust my pillow.\nIt's always lying behind my back.",
                        0
                    ],
                    [
                        "What's red and smells like green paint\nRed paint",
                        0
                    ],
                    [
                        "Did you know that Abraham Lincoln was wrongly accused?\nTurns out he was in a cent.",
                        0
                    ],
                    [
                        "What did the man say when he finished cutting up a green citrus fruit?\nWell, I guess that's the end of the lime",
                        0
                    ],
                    [
                        "My jar of Miracle Whip tasted funny.\nLMAYO",
                        0
                    ],
                    [
                        "What's the best thing about living in Switzerland?\nI don't know but the flag is a big plus",
                        0
                    ]
                ]
            }
        },
        "goodMorning": {
            "regex": [
                "^(good)?\\s?morning(,)?"
            ],
            "responses": {
                "normal": [
                    [
                        "good morning [a]!"
                    ]
                ]
            }
        },
        "ground": {
            "regex": [
                "dad, ground "
            ],
            "responses": {
                "normal": [
                    [
                        "That's it, you're grounded [a]!"
                    ]
                ]
            }
        },
        "grounded": {
            "regex": [
                "dad, grounded"
            ]
        },
        "hiImDad": {
            "regex": [
                "(^|\\W+)i(')?m(\\s\\w.*$)"
            ],
            "responses": {
                "deny": [
                    [
                        "mmmmmmmmmm... no"
                    ]
                ],
                "normal": [
                    [
                        "Hi [a], I'm dad"
                    ]
                ]
            }
        },
        "momName": {
            "regex": [
                "(^|\\s+)mom(my|ma)?($|\\W+)",
                "(^|\\s+)mother($|\\W+)",
                "(^|\\s+)(ma){1,2}($|\\W+)"
            ],
            "responses": {
                "ask": [
                    [
                        "Ask your father."
                    ]
                ]
            }
        },
        "question": {
            "regex": [
                "\\?$"
            ]
        },
        "say": {
            "regex": [
                "dad, say "
            ]
        },
        "unground": {
            "regex": [
                "dad, unground "
            ],
            "responses": {
                "normal": [
                    [
                        "[a], you're now ungrounded. Don't let me catch you misbehaving again."
                    ]
                ]
            }
        }
    },
    "timeout": 4000
}